# WebToeOfFillet Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionIWideFlange..::..WebToeOfFillet Property
StructuralSectionIWideFlange Class See Also
---
Detailing distance from outer face of flange to web toe of fillet, in. (mm)
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public double WebToeOfFillet { get; set; }
```

Visual Basic
---
```text
Public Property WebToeOfFillet As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double WebToeOfFillet {
	double get ();
	void set (double value);
}
```

# See Also
StructuralSectionIWideFlange Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace